# 5. В массиве найти максимальный отрицательный элемент. Вывести на экран его значение и позицию в массиве.
# Примечание к задаче: пожалуйста не путайте «минимальный» и «максимальный отрицательный».
# Это два абсолютно разных значения.

import random


A = [-15, -47, -12, -30, -11, -45, -4, -49]
B = [-32, -23, -42, -99, 18, -56, -70, -97, -67, 60, -56, 53, 1, -32, -27, 40, -97, 55, -12, -63, -47, -9, -35,
     -77, -99, 48, 24, -47, -35, 0, -34, 8, 55, 9, 60, 36, 89, -15, -1, -10, 88, -37, 9, 6, -38, 82, -20, -35, -47, 74]
C = [-751, 685, -484, -789, 66, -798, 354, -642, 1, -630, 984, -351, -227, -305, -69, -436, 677, 871, 130, -802, 962,
     -551, 59, 477, -833, -403, 367, -385, 885, 734, -261, 509, 112, -935, -804, 5, 367, 145, 547, -539, 489, -592, 88,
     -51, 458, 966, 241, -782, 323, 840, 919, 649, -842, 434, -997, -138, -199, 112, 187, 847, 179, -885, -967, -853,
     -71, -943, -946, -897, -571, 4, -739, 213, 975, -27, -93, 988, 412, 732, -341, -160, -227, -546, -597, -428, 162,
     -852, -575, 326, 73, 531, 737, -638, 877, -25, -147, 105, 977, -104, 76, 259]
spam = A
spam.sort()
print(spam)
for i, item in enumerate(spam):
    print(len(spam))
    if i >= len(spam) - 1:
        break
    if item < 0 and spam[i + 1] > 0:
        print(item)
        break
print(item)
